Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་འཁོར་དེའི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས་འཁོར་གྱི་སེམས་ཅན་རྣམས་ལ་རྣམ་པར་བལྟས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Mahākāśyapa knew the thoughts of the assembly with his own mind. So, while casting his gaze over the assembly, he asked the Blessed One,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་འདི་རབ་ཏུ་དྲན་པ་དང་ལྡན་པ་ལགས་ཀྱི་གང་བཅོམ་ལྡན་འདས་ཀྱིས་མང་དུ་ཐོས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནི་མ་ལགས་སམ།
en: “The bodhisattva Sāgaramati is endowed with perfect mindfulness. Is Venerable Ānanda not also? He is the most knowledgeable of all the learned taught by the Thus-Gone One.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་སྲུང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན་སེམས་ཅན་ཇི་ཙམ་དུ་བསྡུ་བར་བསྡུས་པའི་སེམས་ཅན་གྱི་ཁམས་ནི་རབ་ཏུ་མང་གི་སའི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །ཞེས་གང་དེ་སྐད་དུ་བྱ་བ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: “Kāśyapa,” answered the Blessed One, “what do you think about the claim that the dispositions of beings contained within buddha realms as numerous as the grains of sand in the river Ganges are myriad—more so than the elements of earth.

source: འོད་སྲུང་སེམས་ཅན་གྱི་ཁམས་དེ་མང་ངམ།
en: Kāśyapa, are the dispositions of beings myriad?”

source: འོད་སྲུང་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །བདེ་བར་གཤེགས་པ་ཚད་མ་མཆིས་སོ། །
en: “Blessed One, they are myriad. Blissful One, they are limitless,” said Kāśyapa.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་སྲུང་ཡོངས་སུ་རྟག་པ་ཉེ་བར་བཟུང་སྟེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། དེ་བཞིན་དུ་ཇི་ལྟར་དགེ་སློང་ཀུན་དགའ་བོ་ལྟར་དྲན་པ་དང་གཟུངས་ཀྱི་སྟོབས་དང་ཡང་ལྡན་པར་གྱུར་ཀྱང་ཀུན་དགའ་བོ་ལྟ་བུའི་སེམས་ཅན་དེ་དག་གིས་དྲན་པ་དང་གཟུངས་ཀྱི་སྟོབས་དེ་ནི།
en: “Kāśyapa,” the Blessed One continued, “imagine that all those beings attained a human body all at once and that each of them possessed all the power of mindfulness and recollection that the monk Ānanda possesses.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོའི་དྲན་པ་དང་། གཟུངས་ཀྱི་སྟོབས་བསྐྱེད་པར་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་དཔེའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: Even then, they still would not equal even a fraction of the power of mindfulness and recollection produced by the bodhisattva Sāgaramati. No analogy could ever describe it.

source: འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ནི་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་འཛིན་ཏོ། །
en: Kāśyapa, the bodhisattva Sāgaramati retains the teachings of all the blessed buddhas of the ten directions.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གིས་ཆོས་བསྟན་པས་དེ་བཞིན་གཤེགས་པ་གཉིས་ཀྱིས་ཆོས་བསྟན་པ་ལ་སྒྲིབ་པའམ། ཀུན་ནས་ལྡང་བའི་བྱ་བ་མི་བྱེད་དོ། །
en: When one thus-gone one teaches the Dharma, it does not lessen or increase the Dharma teaching of a second thus-gone one.

source: འོད་སྲུང་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Kāśyapa, I will draw an analogy:

source: རྒྱ་མཚོ་ཆེན་པོར་ཤིང་རྟའི་སྲོག་ཤིང་ཙམ་གྱི་ཆར་པའི་རྒྱུན་འབབ་པའི་ཆུའི་རྒྱུན་གཅིག་གིས་ཆུའི་རྒྱུན་གཉིས་པ་ལ་སྒྲིབ་པ་འམ་ཀུན་ནས་ལྡང་བའི་བྱ་བ་མི་བྱེད་དེ
en: A rain the depth of a chariot axle could fall upon the great ocean, but one body of water will not lessen or increase a second body of water.

source: ཆུའི་རྒྱུན་ཐམས་ཅད་ཀྱང་རྒྱ་མཚོ་ཆེན་པོས་བླངས་ནས་དེ་ལ་འགྲིབ་པའམ་གང་བ་ཡང་མེད་དོ། །
en: Even though the ocean absorbs all the flow of all rivers, it does not grow or shrink.

source: འོད་སྲུང་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་ཀུན་ཏུ་འཛིན་ཀྱང་། དེ་བཞིན་གཤེགས་པ་གཅིག་གིས་ཆོས་བསྟན་པས་དེ་བཞིན་གཤེགས་པ་གཉིས་ཀྱིས་ཆོས་བསྟན་པ་ལ་སྒྲིབ་པའམ།
en: Kāśyapa, likewise, though the bodhisattva Sāgaramati retains the Dharma teaching of all the blessed buddhas, the Dharma teaching of one thus-gone one does not lessen or increase the Dharma teaching of a second thus-gone one.

source: ཀུན་ནས་ལྡང་བའི་བྱ་བ་མི་བྱེད་དེདེའི་དྲན་པའི་སྟོབས་སྐྱེད་པ་ལ་བྲི་བའམ་གང་བ་ཡང་མེད་དོ། །
en: There is no increase or decrease to the strength of recollection he has aroused.”

source: བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་བརྒྱད་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: When this teaching was given, eight thousand beings developed the mind directed toward unsurpassed and perfect awakening, and proclaimed,

source: ཚིག་འདི་སྐད་ཅེས་བདག་ཅག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོའི་དྲན་པའི་སྟོབས་བསྐྱེད་པ་ཅི་འདྲ་བ་དེ་འདྲ་བར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ། །
en: “May we develop the strength of recollection to the same degree as the bodhisattva Sāgaramati!”

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱིས་ལྷའི་དང་། མིའི་མེ་ཏོག་གིས་བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་གཏོར་མངོན་པར་གཏོར་ཏོ། །
en: The entire assembly then tossed earthly and divine flowers toward the Blessed One and the bodhisattva Sāgaramati.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་པད་མ་བཀོད་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Padmavyūha then asked the Blessed One,

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཆོས་ཀྱི་སྒོའི་ལེའུ་འདི་ཐོས་ནས་མོས་པ་དང་། མོས་ནས་ཀྱང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། འདོན་པ་དང་། རྟོག་པ་དང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བགྱིས་པ་དེ་བསོད་ནམས་ཇི་ཙམ་ཞིག་སྐྱེད་པར་འགྱུར།
en: “Blessed One, how much merit will a noble son or daughter develop when they hear this Dharma gateway and trust it, or when they retain it, keep it, read it, recite it, understand it, or apply it earnestly?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་པད་མ་བཀོད་པ་ལ་ཚིགས་སུ་བཅད་དེ་
en: The Blessed One then spoke these verses in response to the bodhisattva Padmavyūha:

source: བཀའ་སྩལ་པ། སྟོང་ཆེན་པོ་ཡི་འཇིག་རྟེན་ཁམས་འདི་ནི། །གསེར་གྱིས་བཀང་སྟེ་བདེ་གཤེགས་ཕུལ་བ་བས། །གང་གིས་ཆོས་ཀྱི་མཛོད་འདི་ཐོས་ནས་ནི། །
en: “The merit of filling the worlds of the great trichiliocosm With gold and offering it to the blissful ones, Is exceeded by anyone who hears this Dharma treasure And is inspired by it.

source: མོས་པའི་བསོད་ནམས་འདི་ནི་ཁྱད་པར་འཕགས། །གང་གིས་འཇིག་རྟེན་ཁམས་ཁྲི་རིན་ཆེན་བཀང་། །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཕུལ་བ་བས། །གང་གིས་མདོ་སྡེ་འདི་ལ་འཇུག་བྱས་པ། །
en: “The merit generated by engaging with this sūtra Could not be generated by Someone filling ten thousand worlds with jewels And offering them to the thus-gone ones.

source: བསོད་ནམས་དེ་ལ་སྔ་མས་བསྐྱེད་དུ་མེད། །གང་གིས་འཇིག་རྟེན་ཁམས་ནི་སྟོང་ཕྲག་བཅུ། །རིན་ཆེན་བཀང་སྟེ་སྦྱིན་པ་བྱིན་པ་བས། །གང་གིས་མདོ་འདི་བཏོན་ནས་སྟོན་པ་ཡི། །
en: “Not even a fraction of the merit created by Someone reciting and teaching this sūtra Is present in filling ten thousand worlds With jewels and giving them away.

source: བསོད་ནམས་དེ་ཡི་ཆ་ནི་སྔ་མ་མིན། །ཞིང་ནི་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་གི་རྣམས། །རིན་ཆེན་བཀང་སྟེ་འཇིག་རྟེན་སློབ་དཔོན་སྐྱོབ། །སངས་རྒྱས་རྣམས་ལ་དབུལ་བར་ཕུལ་བ་བས། །
en: “Filling hundreds of billions of realms With jewels and offering them to the buddhas— The teachers and protectors of the world— Does not equal someone applying themselves to this teaching.

source: གང་གིས་ཚུལ་འདིར་རབ་ཏུ་སྦྱོར་བ་དང་། །ཕྱོགས་བཅུ་རྣམས་སུ་གང་གཱའི་བྱེ་སྙེད་ཞིང་། །རིན་ཆེན་བཀང་སྟེ་རྒྱལ་ལ་ཕུལ་བ་བས། །ཇི་ལྟར་བསྟན་པ་བཞིན་དུ་གང་གནས་པའི། །བསོད་ནམས་དེ་ལ་མཉམ་པ་ཡོད་མ་ཡིན། །
en: “The merit of applying this teaching cannot be equaled By filling worlds as numerous as the grains of sand In all the Ganges Rivers throughout the ten directions With jewels and offering them to the victors.

source: རྫོགས་པའི་བྱང་ཆུབ་སེམས་དང་ཆོས་འཛིན་དང་། །ཆོས་སྒྲུབ་པ་དང་སྲོག་ཆགས་སྙིང་རྗེ་བ། །ཆོས་བཞི་འདི་དག་བསོད་ནམས་མཐའ་ཡས་ཏེ། །
en: “Perfecting the mind of awakening, upholding the Dharma, Practicing the Dharma, and having compassion for beings— These four qualities bring infinite merit.

source: དེ་དག་མཐའ་ནི་བདེ་གཤེགས་མི་གསུང་ངོ་། །
en: The Blissful One cannot describe their limit.

source: ནམ་མཁའི་ཁམས་དང་དེ་བཞིན་སེམས་ཅན་ཁམས། །སངས་རྒྱས་ཡེ་ཤེས་དང་ནི་བྱང་ཆུབ་སེམས། །ཆོས་བཞི་འདི་དག་དཔག་ཏུ་མེད་པ་སྟེ། །
en: “The domain of space, the dispositions of beings, Buddhas’ wisdom, and the mind of awakening— These four things are unfathomable.

source: མཁས་པ་རྣམས་ཀྱིས་དེ་ཐོས་དོགས་མི་བྱ། །
en: The learned ones should not doubt this in their studies.

source: དཀོན་མཆོག་ཆོས་འདི་རབ་ཏུ་བཤད་པ་ན། །ཕྱོགས་བཅུའི་ཞིང་ནི་བྱེ་བ་གཡོས་པར་གྱུར། །
en: “When this Dharma jewel is taught, A billion realms in the ten directions will shake.

source: སྣང་བ་བྱུང་ཞིང་མེ་ཏོག་ཆར་ཡང་བབ། །
en: They will be illuminated and flowers will rain down.

source: སིལ་སྙན་བརྒྱ་དག་མ་དཀྲོལ་སྒྲ་ཡང་བྱུང་། །
en: Thousands of cymbals will resound without being played.

source: བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་དེ་དག་ཀུན། །མགུ་ནས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད། །
en: “All learned bodhisattvas will rejoice And marvel to one another,

source: ཆོས་བསྟན་འདི་འདྲ་འདི་ཐོས་བདག་ཅག་རྣམས། །འཚོ་བ་དོན་ཡོད་རྙེད་པ་ལེགས་པར་རྙེད། །
en: ‘In hearing this teaching, we have discovered A truly meaningful way to live!’

source: གང་དག་འདི་འདྲ་འདི་ནི་ཐོས་གྱུར་པ། །སེམས་ཅན་དེ་དག་རྙེད་པ་ལེགས་པར་རྙེད། །
en: “Any being that hears this Will have discovered something great.

source: གང་དག་བྱང་ཆུབ་སེམས་ནི་མི་བརྗེད་པ། །དེ་དག་དེ་བཞིན་གཤེགས་པས་ཤིན་ཏུ་བཟུང་། །
en: Anyone who does not forget the mind of awakening Will be held dear by the thus-gone ones.”

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་སྟོང་ཕྲག་བྱེ་བ་རྣམས། །ཕྱག་ནི་གཡས་པ་རབ་ཏུ་རྐྱང་མཛད་དེ། །ཡོན་ཏན་རྒྱ་མཚོའི་སྤྱི་བོར་བཞག་ནས་ནི། ཤཱཀྱ་སེང་གེའི་བསྐུལ་བ་ལེགས་ཞེས་གསུངས། །
en: Billions of buddhas from the ten directions Extended their right hands and, Placing them upon the crown of the one with ocean-like qualities, They spoke an encouragement of the Lion of the Śākyas.

source: ལྷ་དང་ཀླུ་དང་ལྷ་མིན་མིའམ་ཅི། །དྲི་ཟ་གནོད་སྦྱིན་མཁའ་ལྡིང་ལྟོ་འཕྱེ་ཆེ། །བརྒྱ་བྱིན་ཚངས་པ་འཇིག་རྟེན་སྐྱོང་བ་རྣམས། །ནམ་མཁར་གནས་ཏེ་ཆེད་དུ་བརྗོད་པ་བརྗོད།
en: Gods, nāgas, asuras, kinnaras, Gandharvas, yakṣas, garuḍas, mahoragas, Brahmā, Śakra, and the world protectors Exclaimed in amazement while floating in the sky,

source: ཤཱཀྱ་སེང་གེ་འདི་དང་དགེ་འདུན་དང་། །མདོ་སྡེ་འདི་འདྲ་བ་ནི་འཛིན་བྱེད་པ། །བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བོ་རིང་གནས་གྱུར། །
en: “May the Lion of the Śākyas and the Saṅgha, And those who uphold a sūtra like this, And the heroic bodhisattvas live long!

source: ལེགས་གསུངས་ཆོས་ནི་གཞར་ཡང་ནུབ་མི་འགྱུར། །
en: And may this well-spoken Dharma never fade!

source: གང་དག་ཆོས་ཀྱི་ཚུལ་ནི་འདི་འཛིན་པ། །དེ་དག་ལ་ནི་བདག་ཅག་བསྙེན་བཀུར་བགྱི། །
en: “We will serve anyone Who upholds this Dharma way.

source: བདག་ཅག་ཐམས་ཅད་གུས་དང་བཅས་པར་ནི། །ཀུན་ཏུ་སྲུང་ཞིང་སྤ་བར་སྤྲོ་བར་བགྱི། །
en: We will respectfully protect them, And carefully delight them.”

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཀྱི་ཚུལ་ཆོས་ཀྱི་ཕྱག་རྒྱ། ཆོས་བཏུས་པ། ཆོས་རབ་ཏུ་དབྱེ་བ་འདི་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བཤད་པ། འཆད་པ་འཆད་པར་འགྱུར་བ་སྟེ།
en: “Sāgaramati, this Dharma way, this Dharma seal, this Dharma compilation, this Dharma division has been explained, is being explained, and will be explained by all the blessed buddhas of the past, present, and future.

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྱོད་ཀྱིས་དེ་ལ་གུས་པ་དང་བཅས་པ་དང་། ཞེ་ས་དང་བཅས་པ་དང་། སྒྲུབ་པ་སྙིང་པོར་བྱའོ། །
en: Sāgaramati, with respect and reverence, you must fully accomplish it.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དག་དང་། དགེ་སློང་གི་དགེ་འདུན་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: Once the Blessed One had spoken, the bodhisattva great being Sāgaramati, the entire bodhisattva assembly, the saṅgha of monks, and the world of gods, humans, asuras, and gandharvas all rejoiced and praised what the Blessed One had taught.

source: བྱིན་གྱི་རླབས་ཀྱི་ལེའུ་སྟེ་བཅུ་གཉིས་པའོ། །
en: [Chapter Twelve: Blessings]

source: འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལས། འཕགས་པ་བློ་གྲོས་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་ལྔ་པ་རྫོགས་སོ།། །།
en: This completes “ The Questions of Sāgaramati ,” the fifth section of the Dharma teaching of “ The Great Compilation .”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། བུད་དྷ་པྲ་བྷ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: This was translated, proofed, and finalized according to the new terminological register by the Indian scholars Jinamitra, Dānaśīla, and Buddhaprabhā, as well as the editor-translator, venerable Yeshé Dé.
